app/controllers/api/v1/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def create
    @course = Course.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Math"], ["created_at", "2023-11-29 15:30:11.209768"], ["updated_at", "2023-11-29 15:30:11.209768"]]

  def set_course
  	@course ||= Course.where(id: params[:id]).first
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1  ORDER BY "courses"."id" ASC LIMIT 1  [["id", 99]]